Revit 2024 API
KeyBasedTreeEntry.Key Property
 The key of this entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string Key { get; }
Visual Basic
Public ReadOnly Property Key As String
	Get
Visual C++
public:
property String^ Key {
	String^ get ();
}
Remarks
 This value will be used to do retrieval, sort and comparison. This value should not be empty.
See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace